#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Thu Sep 19 16:00:04 2024

add_design "D:/pds_2022_6/eth_test/source/top.v"
add_constraint "D:/pds_2022_6/eth_test/source/top.fdc"
add_design D:/pds_2022_6/eth_test/ipcore/wave_buf/wave_buf.idf
remove_design D:/pds_2022_6/eth_test/ipcore/wave_buf/wave_buf.idf
add_design "D:/pds_2022_6/eth_test/ipcore/fifo_0/fifo_0.idf"
add_design "D:/pds_2022_6/eth_test/ipcore/hsst_test/hsst_test.idf"
add_design "D:/pds_2022_6/eth_test/ipcore/qsgmii_test/qsgmii_test.idf"
add_design "D:/pds_2022_6/eth_test/source/cross_reset_sync.v"
add_design "D:/pds_2022_6/eth_test/source/gmii_buf.v"
add_design "D:/pds_2022_6/eth_test/source/led_test.v"
add_design "D:/pds_2022_6/eth_test/source/mesethernet_test.v"
add_design "D:/pds_2022_6/eth_test/source/yt_ctrl/mdio_master_driver.v"
add_design "D:/pds_2022_6/eth_test/source/yt_ctrl/reg_ctrl.v"
add_design "D:/pds_2022_6/eth_test/source/yt_ctrl/reset_n_delay.v"
add_design "D:/pds_2022_6/eth_test/source/yt_ctrl/yt8614_ctrl.v"
remove_design -force -verilog "D:/pds_2022_6/eth_test/source/top.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module mesethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module mesethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module mesethernet_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module mesethernet_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module mesethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "C:/Users/14861/Desktop/eth/eth_test/synthesize/mesethernet_test_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module mesethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module mesethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module mesethernet_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
