#Generated by Fabric Compiler ( version 2022.2-SP1-Lite <build 132640> ) at Sun Nov  3 00:38:19 2024

set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module ipsxe_fft_onboard_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream -scbv {High Voltage} 
